Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ثم جعلناك على شريعة من الأمر فاتبعها ولا تتبع أهواء الذين لا يعلمون
en: Then We have put you (O Muhammad صلى الله عليه و سلم) on a (plain) way of (Our) commandment [like the one which We commanded Our Messengers before you (i.e. legal ways and laws of the Islamic Monotheism)]. So follow you that (Islamic Monotheism and its laws), and follow not the desires of those who know not. (Tafsir At-Tabari).

source: إنهم لن يغنوا عنك من الله شيئا وإن الظالمين بعضهم أولياء بعض والله ولي المتقين
en: Verily, they can avail you nothing against Allah (if He wants to punish you). Verily, the Zalimun (polytheists, wrong-doers) are Auliya' (protectors, helpers) of one another, but Allah is the Wali (Helper, Protector) of the Muttaqun (the pious. See V.2:2).

source: هذا بصائر للناس وهدى ورحمة لقوم يوقنون
en: This (Qur'an) is a clear insight and evidence for mankind, and a guidance and a mercy for people who have Faith with certainty.

source: أم حسب الذين اجترحوا السيئات أن نجعلهم كالذين آمنوا وعملوا الصالحات سواء محياهم ومماتهم ساء ما يحكمون
en: Or do those who earn evil deeds think that We shall hold them equal with those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, in their present life and after their death? Worst is the judgement that they make.

source: وخلق الله السماوات والأرض بالحق ولتجزى كل نفس بما كسبت وهم لا يظلمون
en: And Allah has created the heavens and the earth with truth, in order that each person may be recompensed what he has earned, and they will not be wronged.

source: أفرأيت من اتخذ إلهه هواه وأضله الله على علم وختم على سمعه وقلبه وجعل على بصره غشاوة فمن يهديه من بعد الله أفلا تذكرون
en: Have you seen him who takes his own lust (vain desires) as his ilah (god)? And Allah knowing (him as such), left him astray, and sealed his hearing and his heart, and put a cover on his sight. Who then will guide him after Allah? Will you not then remember?

source: وقالوا ما هي إلا حياتنا الدنيا نموت ونحيا وما يهلكنا إلا الدهر وما لهم بذلك من علم إن هم إلا يظنون
en: And they say: "There is nothing but our life of this world, we die and we live and nothing destroys us except Ad-Dahr (time). And they have no knowledge of it: they only conjecture.

source: وإذا تتلى عليهم آياتنا بينات ما كان حجتهم إلا أن قالوا ائتوا بآبائنا إن كنتم صادقين
en: And when Our Clear Verses are recited to them, their argument is no other than that they say: "Bring back our (dead) fathers, if you are truthful!"

source: قل الله يحييكم ثم يميتكم ثم يجمعكم إلى يوم القيامة لا ريب فيه ولكن أكثر الناس لا يعلمون
en: Say (to them): "Allah gives you life, then causes you to die, then He will assemble you on the Day of Resurrection about which there is no doubt. But most of mankind know not."

source: ولله ملك السماوات والأرض ويوم تقوم الساعة يومئذ يخسر المبطلون
en: And to Allah belongs the kingdom of the heavens and the earth. And on the Day that the Hour will be established - on that Day the followers of falsehood (polytheists, disbelievers, worshippers of false deities) shall lose (everything).

source: وترى كل أمة جاثية كل أمة تدعى إلى كتابها اليوم تجزون ما كنتم تعملون
en: And you will see each nation humbled to their knees (kneeling): each nation will be called to its Record (of deeds). This Day you shall be recompensed for what you used to do.

source: هذا كتابنا ينطق عليكم بالحق إنا كنا نستنسخ ما كنتم تعملون
en: This Our Record speaks about you with truth. Verily, We were recording what you used to do (i.e. Our angels used to record your deeds).

source: فأما الذين آمنوا وعملوا الصالحات فيدخلهم ربهم في رحمته ذلك هو الفوز المبين
en: Then, as for those who believed (in the Oneness of Allah - Islamic Monotheism) and did righteous good deeds, their Lord will admit them to His Mercy. That will be the evident success.

source: وأما الذين كفروا أفلم تكن آياتي تتلى عليكم فاستكبرتم وكنتم قوما مجرمين
en: But as for those who disbelieved (it will be said to them): "Were not Our Verses recited to you? But you were proud, and you were a people who were Mujrimun (polytheists, disbelievers, sinners, criminals)."

source: وإذا قيل إن وعد الله حق والساعة لا ريب فيها قلتم ما ندري ما الساعة إن نظن إلا ظنا وما نحن بمستيقنين
en: And when it was said: "Verily, Allah's Promise is the truth, and there is no doubt about the coming of the Hour," you said: "We know not what is the Hour: we do not think it but as a conjecture, and we have no firm convincing belief (therein)."

source: وبدا لهم سيئات ما عملوا وحاق بهم ما كانوا به يستهزئون
en: And the evil of what they did will appear to them, and that which they used to mock at will completely encircle them.

source: وقيل اليوم ننساكم كما نسيتم لقاء يومكم هذا ومأواكم النار وما لكم من ناصرين
en: And it will be said: "This Day We will forget you as you forgot the Meeting of this Day of yours. And your abode is the Fire, and there is none to help you."

source: ذلكم بأنكم اتخذتم آيات الله هزوا وغرتكم الحياة الدنيا فاليوم لا يخرجون منها ولا هم يستعتبون
en: This, because you took the revelations of Allah (this Qur'an) in mockery, and the life of the world deceived you. So this Day, they shall not be taken out from there (Hell), nor shall they be returned to the worldly life, (so that they repent to Allah, and beg His Pardon for their sins).

source: فلله الحمد رب السماوات ورب الأرض رب العالمين
en: So all the praises and thanks be to Allah, the Lord of the heavens and the Lord of the earth, and the Lord of the 'Alamin (mankind, jinn and all that exists).

source: وله الكبرياء في السماوات والأرض وهو العزيز الحكيم
en: And His (Alone) is the Majesty in the heavens and the earth, and He is the All-Mighty, the All-Wise.

source: ما خلقنا السماوات والأرض وما بينهما إلا بالحق وأجل مسمى والذين كفروا عما أنذروا معرضون
en: We created not the heavens and the earth and all that is between them except with truth, and for an appointed term. But those who disbelieve turn away from that whereof they are warned.

source: قل أرأيتم ما تدعون من دون الله أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات ائتوني بكتاب من قبل هذا أو أثارة من علم إن كنتم صادقين
en: Say (O Muhammad صلى الله عليه وسلم to these pagans): "Think you about all that you invoke besides Allah? Show me. What have they created of the earth? Or have they a share in (the creation of) the heavens? Bring me a Book (revealed before this), or some trace of knowledge (in support of your claims), if you are truthful!"

source: ومن أضل ممن يدعو من دون الله من لا يستجيب له إلى يوم القيامة وهم عن دعائهم غافلون
en: And who is more astray than one who calls on (invokes) besides Allah, such as will not answer him till the Day of Resurrection, and who are (even) unaware of their calls (invocations) to them?

source: وإذا حشر الناس كانوا لهم أعداء وكانوا بعبادتهم كافرين
en: And when mankind are gathered (on the Day of Resurrection), they (false deities) will become their enemies and will deny their worshipping.

source: وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للحق لما جاءهم هذا سحر مبين
en: And when Our Clear Verses are recited to them, the disbelievers say of the truth (this Qur'an) when it reaches them: "This is plain magic!"

source: أم يقولون افتراه قل إن افتريته فلا تملكون لي من الله شيئا هو أعلم بما تفيضون فيه كفى به شهيدا بيني وبينكم وهو الغفور الرحيم
en: Or say they: "He (Muhammad صلى الله عليه وسلم) has fabricated it." Say: "If I have fabricated it? still you have no power to support me against Allah. He knows best of what you say among yourselves concerning it (i.e. this Qur'an)! Sufficient is He as a witness between me and you! And He is the Oft-Forgiving, the Most Merciful."

source: قل ما كنت بدعا من الرسل وما أدري ما يفعل بي ولا بكم إن أتبع إلا ما يوحى إلي وما أنا إلا نذير مبين
en: Say (O Muhammad صلى الله عليه وسلم): "I am not a new thing among the Messengers (of Allah i.e. I am not the first Messenger) nor do I know what will be done with me or with you. I only follow that which is revealed to me, and I am but a plain warner."

source: قل أرأيتم إن كان من عند الله وكفرتم به وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم إن الله لا يهدي القوم الظالمين
en: Say: "Tell me! If this (Qur'an) is from Allah and you deny it, and a witness from among the Children of Israel ('Abdullah bin Salam رضي الله عنه) testifies that [this Qur'an is from Allah (like the Taurat (Torah)], and he believed (embraced Islam) while you are too proud (to believe)." Verily, Allah guides not the people who are Zalimun (polytheists, disbelievers and wrong-doers).

source: وقال الذين كفروا للذين آمنوا لو كان خيرا ما سبقونا إليه وإذ لم يهتدوا به فسيقولون هذا إفك قديم
en: And those who disbelieve (the strong and wealthy) say of those who believe (the weak and poor): "Had it (Islamic Monotheism to which Muhammad صلى الله عليه وسلم is inviting mankind) been a good thing, they (the weak and poor) would not have preceded us thereto!" And when they have not let themselves be guided by it (this Qur'an), they say: "This is an ancient lie!"

source: ومن قبله كتاب موسى إماما ورحمة وهذا كتاب مصدق لسانا عربيا لينذر الذين ظلموا وبشرى للمحسنين
en: And before this was the Scripture of Musa (Moses) as a guide and a mercy. And this is a confirming Book (the Qur'an) in the Arabic language, to warn those who do wrong, and as glad tidings to the Muhsinun (good-doers. See the footnote of V.9:120).

source: إن الذين قالوا ربنا الله ثم استقاموا فلا خوف عليهم ولا هم يحزنون
en: Verily, those who say: "Our Lord is (only) Allah," and thereafter stand firm and straight on the Islamic Faith of Monotheism, on them shall be no fear, nor shall they grieve.

source: أولئك أصحاب الجنة خالدين فيها جزاء بما كانوا يعملون
en: Such shall be the dwellers of Paradise, abiding therein (forever) - a reward for what they used to do.

source: ووصينا الإنسان بوالديه إحسانا حملته أمه كرها ووضعته كرها وحمله وفصاله ثلاثون شهرا حتى إذا بلغ أشده وبلغ أربعين سنة قال رب أوزعني أن أشكر نعمتك التي أنعمت علي وعلى والدي وأن أعمل صالحا ترضاه وأصلح لي في ذريتي إني تبت إليك وإني من المسلمين
en: And We have enjoined on man to be dutiful and kind to his parents. His mother bears him with hardship. And she brings him forth with hardship, and the bearing of him, and the weaning of him is thirty months, till when he attains full strength and reaches forty years, he says: "My Lord! Grant me the power and ability that I may be grateful for Your Favour which You have bestowed upon me and upon my parents, and that I may do righteous good deeds, such as please You, and make my offspring good. Truly, I have turned to You in repentance, and truly, I am one of the Muslims (submitting to Your Will)."

source: أولئك الذين نتقبل عنهم أحسن ما عملوا ونتجاوز عن سيئاتهم في أصحاب الجنة وعد الصدق الذي كانوا يوعدون
en: They are those from whom We shall accept the best of their deeds and overlook their evil deeds. (They shall be) among the dwellers of Paradise - a promise of truth, which they have been promised.

source: والذي قال لوالديه أف لكما أتعدانني أن أخرج وقد خلت القرون من قبلي وهما يستغيثان الله ويلك آمن إن وعد الله حق فيقول ما هذا إلا أساطير الأولين
en: But he who says to his parents: "Fie upon you both! Do you hold out the promise to me that I shall be raised up (again) when generations before me have passed away (without rising)?" While they (father and mother) invoke Allah for help (and rebuke their son): "Woe to you! Believe! Verily, the Promise of Allah is true." But he says: "This is nothing but the tales of the ancient."

source: أولئك الذين حق عليهم القول في أمم قد خلت من قبلهم من الجن والإنس إنهم كانوا خاسرين
en: They are those against whom the Word (of torment) is justified among the previous generations of jinn and mankind that have passed away. Verily, they are ever the losers.

source: ولكل درجات مما عملوا وليوفيهم أعمالهم وهم لا يظلمون
en: And for all, there will be degrees according to that which they did, that He (Allah) may recompense them in full for their deeds. And they will not be wronged.

source: ويوم يعرض الذين كفروا على النار أذهبتم طيباتكم في حياتكم الدنيا واستمتعتم بها فاليوم تجزون عذاب الهون بما كنتم تستكبرون في الأرض بغير الحق وبما كنتم تفسقون
en: On the Day when those who disbelieve (in the Oneness of Allah - Islamic Monotheism) will be exposed to the Fire (it will be said): "You received your good things in the life of the world, and you took your pleasure therein. Now this Day you shall be recompensed with a torment of humiliation, because you were arrogant in the land without a right, and because you used to rebel against Allah's Command (disobey Allah).

source: واذكر أخا عاد إذ أنذر قومه بالأحقاف وقد خلت النذر من بين يديه ومن خلفه ألا تعبدوا إلا الله إني أخاف عليكم عذاب يوم عظيم
en: And remember (Hud) the brother of 'Ad, when he warned his people in Al-Ahqaf (the curved sand-hills in the southern part of Arabian Peninsula). And surely, there have passed away warners before him and after him (saying): "Worship none but Allah; truly, I fear for you the torment of a mighty Day (i.e. the Day of Resurrection)."

source: قالوا أجئتنا لتأفكنا عن آلهتنا فأتنا بما تعدنا إن كنت من الصادقين
en: They said: "Have you come to turn us away from our alihah (gods)? Then bring us that with which you threaten us, if you are one of the truthful!"

source: قال إنما العلم عند الله وأبلغكم ما أرسلت به ولكني أراكم قوما تجهلون
en: He said: "The knowledge (of the time of its coming) is with Allah only. And I convey to you that wherewith I have been sent, but I see that you are a people given to ignorance!"

source: فلما رأوه عارضا مستقبل أوديتهم قالوا هذا عارض ممطرنا بل هو ما استعجلتم به ريح فيها عذاب أليم
en: Then, when they saw it as a dense cloud coming towards their valleys, they said: "This is a cloud bringing us rain!" Nay, but it is that (torment) which you were asking to be hastened - a wind wherein is a painful torment!

source: تدمر كل شيء بأمر ربها فأصبحوا لا يرى إلا مساكنهم كذلك نجزي القوم المجرمين
en: Destroying everything by the Command of its Lord! So they became such that nothing could be seen except their dwellings! Thus do We recompense the people who are Mujrimun (polytheists, disbelievers, sinners)!

source: ولقد مكناهم فيما إن مكناكم فيه وجعلنا لهم سمعا وأبصارا وأفئدة فما أغنى عنهم سمعهم ولا أبصارهم ولا أفئدتهم من شيء إذ كانوا يجحدون بآيات الله وحاق بهم ما كانوا به يستهزئون
en: And indeed We had firmly established them with that wherewith We have not established you (O Quraish)! And We had assigned them the (faculties of) hearing (ears), seeing (eyes), and hearts; but their hearing (ears), seeing (eyes), and their hearts availed them nothing since they used to deny the Ayat (Allah's Prophets and their Prophethood, proofs, evidence, verses, signs, revelations) of Allah, and they were completely encircled by that which they used to mock at!

source: ولقد أهلكنا ما حولكم من القرى وصرفنا الآيات لعلهم يرجعون
en: And indeed We have destroyed towns (populations) round about you, and We have (repeatedly) shown (them) the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) in various ways that they might return (to the truth and believe in the Oneness of Allah - Islamic Monotheism).

source: فلولا نصرهم الذين اتخذوا من دون الله قربانا آلهة بل ضلوا عنهم وذلك إفكهم وما كانوا يفترون
en: Then why did those whom they had taken for alihah (gods) besides Allah, as a way of approach (to Allah) not help them? Nay, but they vanished completely from them (when there came the torment). And that was their lie, and their inventions which they had been inventing (before their destruction).

source: وإذ صرفنا إليك نفرا من الجن يستمعون القرآن فلما حضروه قالوا أنصتوا فلما قضي ولوا إلى قومهم منذرين
en: And (remember) when We sent towards you (Muhammad صلى الله عليه وسلم) a group (three to ten persons) of the jinn, (quietly) listening to the Qur'an. When they stood in the presence thereof, they said: "Listen in silence!" And when it was finished, they returned to their people, as warners.

source: قالوا يا قومنا إنا سمعنا كتابا أنزل من بعد موسى مصدقا لما بين يديه يهدي إلى الحق وإلى طريق مستقيم
en: They said: "O our people! Verily, we have heard a Book (this Qur'an) sent down after Musa (Moses), confirming what came before it: it guides to the truth and to the Straight Path (i.e. Islam).

source: يا قومنا أجيبوا داعي الله وآمنوا به يغفر لكم من ذنوبكم ويجركم من عذاب أليم
en: O our people! Respond (with obedience) to Allah's Caller (i.e. Allah's Messenger Muhammad صلى الله عليه وسلم), and believe in him (i.e. believe in that which Muhammad صلى الله عليه وسلم has brought from Allah and follow him). He (Allah) will forgive you of your sins, and will save you from a painful torment (i.e. Hell-fire)

source: ومن لا يجب داعي الله فليس بمعجز في الأرض وليس له من دونه أولياء أولئك في ضلال مبين
en: And whosoever does not respond to Allah's Caller, he cannot escape on earth, and there will be no Auliya' (lords, helpers, supporters, protectors) for him besides Allah (from Allah's punishment). Those are in manifest error.

source: أولم يروا أن الله الذي خلق السماوات والأرض ولم يعي بخلقهن بقادر على أن يحيي الموتى بلى إنه على كل شيء قدير
en: Do they not see that Allah, Who created the heavens and the earth, and was not wearied by their creation, is Able to give life to the dead? Yes, He surely is Able to do all things.

source: ويوم يعرض الذين كفروا على النار أليس هذا بالحق قالوا بلى وربنا قال فذوقوا العذاب بما كنتم تكفرون
en: And on the Day when those who disbelieve will be exposed to the Fire (it will be said to them): "Is this not the truth?" They will say: "Yes, By our Lord!" He will say: "Then taste the torment, because you used to disbelieve!"

source: فاصبر كما صبر أولو العزم من الرسل ولا تستعجل لهم كأنهم يوم يرون ما يوعدون لم يلبثوا إلا ساعة من نهار بلاغ فهل يهلك إلا القوم الفاسقون
en: Therefore be patient (O Muhammad صلى الله عليه وسلم) as did the Messengers of strong will and be in no haste about them (disbelievers). On the Day when they will see that (torment) with which they are promised (i.e. threatened, it will be) as if they had not stayed more than an hour in a single day. (O mankind! this Qur'an is sufficient as) a clear Message (or proclamation to save yourself from destruction). But shall any be destroyed except the people who are Al-Fasiqun (the rebellious against Allah's Command, the disobedient to Allah)?

source: الذين كفروا وصدوا عن سبيل الله أضل أعمالهم
en: Those who disbelieve (in the Oneness of Allah, and in the Message of Prophet Muhammad صلى الله عليه وسلم), and hinder (men) from the Path of Allah (Islamic Monotheism), He will render their deeds vain.

source: والذين آمنوا وعملوا الصالحات وآمنوا بما نزل على محمد وهو الحق من ربهم كفر عنهم سيئاتهم وأصلح بالهم
en: But those who believe and do righteous good deeds, and believe in that which is sent down to Muhammad (صلى الله عليه وسلم) - for it is the truth from their Lord - He will expiate from them their sins, and will make good their state.

source: ذلك بأن الذين كفروا اتبعوا الباطل وأن الذين آمنوا اتبعوا الحق من ربهم كذلك يضرب الله للناس أمثالهم
en: That is because those who disbelieve follow falsehood, while those who believe follow the truth from their Lord. Thus does Allah set forth for mankind their parables.

source: فإذا لقيتم الذين كفروا فضرب الرقاب حتى إذا أثخنتموهم فشدوا الوثاق فإما منا بعد وإما فداء حتى تضع الحرب أوزارها ذلك ولو يشاء الله لانتصر منهم ولكن ليبلو بعضكم ببعض والذين قتلوا في سبيل الله فلن يضل أعمالهم
en: So, when you meet (in fight - Jihad in Allah's Cause) those who disbelieve, smite (their) necks till when you have killed and wounded many of them, then bind a bond firmly (on them, i.e. take them as captives). Thereafter (is the time) either for generosity (i.e. free them without ransom), or ransom (according to what benefits Islam), until the war lays down its burden. Thus [you are ordered by Allah to continue in carrying out Jihad against the disbelievers till they embrace Islam and are saved from the punishment in the Hell-fire or at least come under your protection], but if it had been Allah's Will, He Himself could certainly have punished them (without you). But (He lets you fight) in order to test some of you with others. But those who are killed in the Way of Allah, He will never let their deeds be lost.

source: سيهديهم ويصلح بالهم
en: He will guide them and set right their state.

source: ويدخلهم الجنة عرفها لهم
en: And admit them to Paradise which He has made known to them (i.e. they will know their places in Paradise better than they used to know their homes in the world). [Tafsir Ibn Kathir ]

source: يا أيها الذين آمنوا إن تنصروا الله ينصركم ويثبت أقدامكم
en: O you who believe! If you help (in the cause of) Allah, He will help you, and make your foothold firm.

source: والذين كفروا فتعسا لهم وأضل أعمالهم
en: But those who disbelieve (in the Oneness of Allah - Islamic Monotheism), for them is destruction, and (Allah) will make their deeds vain.

source: ذلك بأنهم كرهوا ما أنزل الله فأحبط أعمالهم
en: That is because they hate that which Allah has sent down (this Qur'an and Islamic laws, etc.); so He has made their deeds fruitless.

source: أفلم يسيروا في الأرض فينظروا كيف كان عاقبة الذين من قبلهم دمر الله عليهم وللكافرين أمثالها
en: Have they not travelled through the earth, and seen what was the end of those before them? Allah destroyed them completely, and a similar (fate awaits) the disbelievers.

source: ذلك بأن الله مولى الذين آمنوا وأن الكافرين لا مولى لهم
en: That is because Allah is the Maula (Lord, Master, Helper, Protector, etc.) of those who believe, and the disbelievers have no Maula (lord, master, helper, protector, etc.).

source: إن الله يدخل الذين آمنوا وعملوا الصالحات جنات تجري من تحتها الأنهار والذين كفروا يتمتعون ويأكلون كما تأكل الأنعام والنار مثوى لهم
en: Certainly Allah will admit those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds, to Gardens under which rivers flow (Paradise); while those who disbelieve enjoy themselves and eat as cattle eat; and the Fire will be their abode.

source: وكأين من قرية هي أشد قوة من قريتك التي أخرجتك أهلكناهم فلا ناصر لهم
en: And many a town, stronger than your town (Makkah) (O Muhammad صلى الله عليه وسلم) which has driven you out We have destroyed. And there was none to help them.

source: أفمن كان على بينة من ربه كمن زين له سوء عمله واتبعوا أهواءهم
en: Is he who is on a clear proof from his Lord, like those for whom their evil deeds that they do are beautified for them, while they follow their own lusts (evil desires)?

source: مثل الجنة التي وعد المتقون فيها أنهار من ماء غير آسن وأنهار من لبن لم يتغير طعمه وأنهار من خمر لذة للشاربين وأنهار من عسل مصفى ولهم فيها من كل الثمرات ومغفرة من ربهم كمن هو خالد في النار وسقوا ماء حميما فقطع أمعاءهم
en: The description of Paradise which the Muttaqun (the pious. See V.2:2) have been promised (is that) in it are rivers of water the taste and smell of which are not changed, rivers of milk of which the taste never changes, rivers of wine delicious to those who drink, and rivers of clarified honey (clear and pure) therein for them is every kind of fruit, and forgiveness from their Lord. (Are these) like those who shall dwell for ever in the Fire and be given to drink boiling water so that it cuts up their bowels?

source: ومنهم من يستمع إليك حتى إذا خرجوا من عندك قالوا للذين أوتوا العلم ماذا قال آنفا أولئك الذين طبع الله على قلوبهم واتبعوا أهواءهم
en: And among them are some who listen to you (O Muhammad صلى الله عليه وسلم) till when they go out from you, they say to those who have received knowledge: "What has he said just now? Such are men whose hearts Allah has sealed, and they follow their lusts (evil desires).

source: والذين اهتدوا زادهم هدى وآتاهم تقواهم
en: While as for those who accept guidance, He increases their guidance and bestows on them their piety.
